-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2023-02-03 15:56:41
-- 服务器版本： 5.7.28
-- PHP 版本： 7.3.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `yuanfang`
--

-- --------------------------------------------------------

--
-- 表的结构 `ads`
--

CREATE TABLE `ads` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `url` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `ads`
--

INSERT INTO `ads` (`id`, `title`, `url`) VALUES
(1, '广告1', 'http://itying.com/images/flutter/1.png'),
(2, '广告2', 'http://itying.com/images/flutter/2.png'),
(3, '广告1', 'http://itying.com/images/flutter/3.png'),
(4, '广告2', 'http://itying.com/images/flutter/4.png');

-- --------------------------------------------------------

--
-- 表的结构 `airport_list`
--

CREATE TABLE `airport_list` (
  `id` int(11) NOT NULL,
  `cityName` char(50) NOT NULL,
  `cityId` int(11) NOT NULL,
  `firstLetter` char(50) NOT NULL,
  `airportName` char(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `airport_list`
--

INSERT INTO `airport_list` (`id`, `cityName`, `cityId`, `firstLetter`, `airportName`) VALUES
(537, '阿勒泰', 175, 'A', '阿勒泰机场'),
(538, '兴义', 1139, 'X', '兴义机场'),
(539, '百色', 1140, 'B', '百色机场'),
(540, '红原', 7835, 'H', '阿坝红原机场'),
(541, '安康', 171, 'A', '安康富强机场'),
(542, '阿克苏', 173, 'A', '阿克苏机场'),
(543, '鞍山', 178, 'A', '鞍山腾鳌机场'),
(544, '安庆', 177, 'A', '天柱山机场'),
(545, '安顺', 179, 'A', '黄果树机场'),
(546, '阿拉善左旗', 21269, 'A', '阿拉善左旗机场'),
(547, '琼海', 52, 'Q', '博鳌机场'),
(548, '包头', 141, 'B', '东河机场'),
(549, '毕节', 22031, 'B', '飞雄机场'),
(550, '北海', 189, 'B', '福成机场'),
(551, '秦皇岛', 147, 'Q', '北戴河机场'),
(552, '博乐', 2548, 'B', '博乐机场'),
(553, '昌都', 575, 'C', '昌都邦达机场'),
(554, '保山', 197, 'B', '保山机场'),
(555, '广州', 32, 'G', '新白云国际机场'),
(556, '常德', 201, 'C', '桃花源机场'),
(557, '郑州', 559, 'Z', '新郑国际机场'),
(558, '长春', 158, 'C', '龙嘉国际机场'),
(559, '朝阳', 211, 'C', '朝阳机场'),
(560, '赤峰', 202, 'C', '玉龙机场'),
(561, '长治', 137, 'C', '长治机场'),
(562, '重庆', 4, 'C', '江北国际机场'),
(563, '重庆', 4, 'C', '江北国际机场'),
(564, '重庆', 4, 'Z', '江北国际机场'),
(565, '长沙', 206, 'C', '黄花国际机场'),
(566, '成都', 28, 'C', '双流国际机场'),
(567, '常州', 213, 'C', '奔牛国际机场'),
(568, '大同', 136, 'D', '大同云冈机场'),
(569, '达县', 234, 'D', '达县机场'),
(570, '达州', 234, 'D', '达县机场'),
(571, '稻城', 1222, 'D', '亚丁机场'),
(572, '丹东', 221, 'D', '浪头机场'),
(573, '迪庆', 93, 'D', '香格里拉机场'),
(574, '香格里拉', 93, 'X', '香格里拉机场'),
(575, '大连', 6, 'D', '周水子国际机场'),
(576, '大理', 36, 'D', '大理机场'),
(577, '敦煌', 11, 'D', '敦煌机场'),
(578, '东营', 236, 'D', '胜利机场'),
(579, '大庆', 231, 'D', '萨尔图机场'),
(580, '鄂尔多斯', 3976, 'E', '鄂尔多斯机场'),
(581, '张家界', 27, 'Z', '荷花机场'),
(582, '额济纳旗', 21339, 'E', '桃来机场'),
(583, '恩施', 245, 'E', '许家坪机场'),
(584, '延安', 110, 'Y', '南泥湾机场'),
(585, '二连浩特', 7626, 'E', '赛乌苏国际机场'),
(586, '福州', 258, 'F', '长乐国际机场'),
(587, '阜阳', 257, 'F', '西关机场'),
(588, '佛山', 251, 'F', '沙堤机场'),
(589, '抚远', 21943, 'F', '东极机场'),
(590, '富蕴', 255, 'F', '富蕴机场'),
(591, '广汉', 750, 'G', '广汉机场'),
(592, '果洛', 21862, 'G', '玛沁机场'),
(593, '格尔木', 132, 'G', '格尔木机场'),
(594, '夏河', 497, 'X', '夏河机场'),
(595, '广元', 267, 'G', '盘龙机场'),
(596, '固原', 321, 'G', '六盘山机场'),
(597, '海口', 42, 'H', '美兰机场'),
(598, '河池', 3969, 'H', '金城江机场'),
(599, '邯郸', 275, 'H', '邯郸机场'),
(600, '黑河', 281, 'H', '黑河机场'),
(601, '呼和浩特', 103, 'H', '白塔国际机场'),
(602, '合肥', 278, 'H', '新桥国际机场'),
(603, '杭州', 17, 'H', '萧山国际机场'),
(604, '淮安', 577, 'H', '涟水机场'),
(605, '怀化', 282, 'H', '芷江机场'),
(606, '芷江', 282, 'Z', '芷江机场'),
(607, '海拉尔', 142, 'H', '东山机场'),
(608, '乌兰浩特', 484, 'W', '乌兰浩特机场'),
(609, '哈密', 285, 'H', '哈密机场'),
(610, '衡阳', 297, 'H', '南岳机场'),
(611, '神农架', 657, 'S', '红坪机场'),
(612, '哈尔滨', 5, 'H', '太平国际机场'),
(613, '普陀山', 19, 'P', '普陀山机场'),
(614, '舟山', 19, 'Z', '普陀山机场'),
(615, '和田', 294, 'H', '和田机场'),
(616, '花土沟', 83679, 'H', '花土沟机场'),
(617, '惠州', 299, 'H', '平潭机场'),
(618, '德令哈', 2542, 'D', '德令哈机场'),
(619, '台州', 578, 'T', '路桥机场'),
(620, '汉中', 129, 'H', '城固机场'),
(621, '黎平', 3852, 'L', '黎平机场'),
(622, '银川', 99, 'Y', '河东机场'),
(623, '且末', 399, 'Q', '且末机场'),
(624, '庆阳', 404, 'Q', '庆阳机场'),
(625, '景德镇', 305, 'J', '景德镇机场'),
(626, '加格达奇', 1143, 'J', '加格达奇机场'),
(627, '嘉峪关', 326, 'J', '嘉峪关机场'),
(628, '井冈山', 307, 'J', '井冈山机场'),
(629, '景洪', 35, 'J', '西双版纳机场'),
(630, '西双版纳', 35, 'X', '西双版纳机场'),
(631, '金昌', 1158, 'J', '金昌金川机场'),
(632, '吉林', 159, 'J', '二台子机场'),
(633, '黔江', 7708, 'Q', '黔江武陵山机场'),
(634, '九江', 24, 'J', '庐山机场'),
(635, '晋江', 406, 'J', '泉州晋江机场'),
(636, '泉州', 406, 'Q', '泉州晋江机场'),
(637, '石狮', 406, 'S', '泉州晋江机场'),
(638, '佳木斯', 317, 'J', '东郊机场'),
(639, '济宁', 318, 'J', '曲阜机场'),
(640, '锦州', 327, 'J', '锦州湾机场'),
(641, '池州', 218, 'C', '九华山机场'),
(642, '衢州', 407, 'Q', '衢州机场'),
(643, '鸡西', 157, 'J', '兴凯湖机场'),
(644, '九寨沟', 91, 'J', '黄龙机场'),
(645, '库车', 329, 'K', '库车机场'),
(646, '康定', 4130, 'K', '康定机场'),
(647, '喀什', 109, 'K', '喀什机场'),
(648, '南昌', 376, 'N', '昌北国际机场'),
(649, '凯里', 333, 'K', '黄平机场'),
(650, '喀纳斯', 3326, 'K', '喀纳斯机场'),
(651, '昆明', 34, 'K', '长水国际机场'),
(652, '金门', 7203, 'J', '尚义机场'),
(653, '赣州', 268, 'G', '黄金机场'),
(654, '库尔勒', 330, 'K', '库尔勒机场'),
(655, '克拉玛依', 166, 'K', '克拉玛依机场'),
(656, '贵阳', 38, 'G', '龙洞堡机场'),
(657, '桂林', 33, 'G', '两江国际机场'),
(658, '连城', 348, 'L', '冠豸山机场'),
(659, '龙岩', 348, 'L', '冠豸山机场'),
(660, '伊春', 517, 'Y', '林都机场'),
(661, '临汾', 139, 'L', '尧都机场'),
(662, '光化', 2155, 'G', '光化机场'),
(663, '兰州', 100, 'L', '中川机场'),
(664, '梁平', 427, 'L', '梁平机场'),
(665, '丽江', 37, 'L', '丽江机场'),
(666, '荔波', 1708, 'L', '荔波机场'),
(667, '永州', 970, 'Y', '零陵机场'),
(668, '吕梁', 7631, 'L', '吕梁机场'),
(669, '临沧', 1236, 'L', '临沧机场'),
(670, '六盘水', 605, 'L', '月照机场'),
(672, '芒市', 3997, 'M', '德宏芒市机场'),
(673, '拉萨', 41, 'L', '贡嘎机场'),
(674, '林西', 744, 'L', '林西机场'),
(675, '洛阳', 350, 'L', '北郊机场'),
(676, '连云港', 353, 'L', '白塔埠机场'),
(677, '临沂', 569, 'L', '临沂启阳机场'),
(678, '柳州', 354, 'L', '白莲机场'),
(679, '泸州', 355, 'L', '云龙机场'),
(680, '林芝', 108, 'L', '林芝米林机场'),
(681, '牡丹江', 150, 'M', '海浪机场'),
(682, '绵阳', 370, 'M', '南郊机场'),
(683, '梅县', 3053, 'M', '梅县机场'),
(684, '梅州', 3053, 'M', '梅县机场'),
(685, '南充', 377, 'N', '高坪机场'),
(686, '北京', 1, 'B', '南苑机场'),
(687, '长白山', 199, 'C', '长白山机场'),
(688, '齐齐哈尔', 149, 'Q', '三家子机场'),
(689, '宁波', 375, 'N', '栎社国际机场'),
(690, '阿里', 97, 'A', '阿里昆莎机场'),
(691, '南京', 12, 'N', '禄口国际机场'),
(692, '宁蒗', 1161, 'N', '泸沽湖机场'),
(693, '那拉提', 3360, 'N', '那拉提机场'),
(694, '南宁', 380, 'N', '吴圩国际机场'),
(695, '南阳', 385, 'N', '姜营机场'),
(696, '南通', 82, 'N', '兴东机场'),
(697, '满洲里', 1083, 'M', '西郊机场'),
(698, '漠河', 155, 'M', '漠河机场'),
(699, '北京', 1, 'B', '首都国际机场'),
(700, '上海', 2, 'S', '浦东国际机场'),
(701, '攀枝花', 1097, 'P', '保安营机场'),
(702, '阿拉善右旗', 21863, 'A', '阿拉善右旗机场'),
(703, '日照', 1106, 'R', '山字河机场'),
(704, '日喀则', 92, 'R', '日喀则和平机场'),
(705, '巴彦淖尔', 3887, 'B', '天吉泰机场'),
(706, '上海', 2, 'S', '虹桥国际机场'),
(707, '沈阳', 451, 'S', '桃仙国际机场'),
(708, '石河子', 426, 'S', '花园机场'),
(711, '沙市', 328, 'S', '沙市机场'),
(712, '石家庄', 428, 'S', '正定国际机场'),
(713, '三明', 437, 'S', '沙县机场'),
(715, '揭阳', 956, 'J', '揭阳潮汕机场'),
(716, '普洱', 3996, 'P', '思茅机场'),
(717, '思茅', 3996, 'S', '思茅机场'),
(718, '三亚', 43, 'S', '凤凰国际机场'),
(719, '深圳', 30, 'S', '宝安国际机场'),
(720, '青岛', 7, 'Q', '胶东国际机场'),
(721, '塔城', 455, 'T', '塔城民航机场'),
(722, '腾冲', 1819, 'T', '腾冲机场'),
(723, '铜仁', 1227, 'T', '铜仁凤凰机场'),
(724, '通辽', 458, 'T', '通辽机场'),
(725, '天水', 464, 'T', '天水机场'),
(726, '吐鲁番', 21811, 'T', '吐鲁番机场'),
(727, '济南', 144, 'J', '遥墙国际机场'),
(728, '通化', 456, 'T', '三源浦机场'),
(729, '天津', 3, 'T', '滨海国际机场'),
(730, '台东', 3848, 'T', '台东机场'),
(731, '唐山', 468, 'T', '三女河机场'),
(732, '黄山', 23, 'H', '屯溪机场'),
(733, '太原', 105, 'T', '武宿国际机场'),
(734, '乌兰察布', 7518, 'W', '乌兰察布机场'),
(735, '乌鲁木齐', 39, 'W', '地窝堡国际机场'),
(736, '榆林', 527, 'Y', '榆阳机场'),
(737, '十堰', 452, 'S', '武当山机场'),
(738, '潍坊', 475, 'W', '潍坊机场'),
(739, '威海', 479, 'W', '大水泊国际机场'),
(740, '文山', 1342, 'W', '文山普者黑机场'),
(741, '温州', 491, 'W', '温州龙湾国际机场'),
(742, '乌海', 1133, 'W', '乌海机场'),
(743, '武汉', 477, 'W', '天河国际机场'),
(744, '武夷山', 26, 'W', '武夷山机场'),
(745, '忻州', 513, 'X', '五台山机场'),
(746, '无锡', 13, 'W', '无锡硕放机场'),
(747, '梧州', 492, 'W', '西江机场'),
(748, '万州', 487, 'W', '五桥机场'),
(749, '襄阳', 496, 'X', '刘集机场'),
(750, '西昌', 494, 'X', '青山机场'),
(751, '锡林浩特', 500, 'X', '锡林浩特机场'),
(752, '西安', 10, 'X', '咸阳国际机场'),
(753, '厦门', 25, 'X', '高崎国际机场'),
(754, '西宁', 124, 'X', '曹家堡机场'),
(755, '徐州', 512, 'X', '观音机场'),
(756, '宜宾', 514, 'Y', '五粮液机场'),
(757, '运城', 140, 'Y', '张孝机场'),
(758, '宜春', 518, 'Y', '明月山机场'),
(759, '阿尔山', 1658, 'A', '伊尔施机场'),
(760, '宜昌', 515, 'Y', '三峡机场'),
(761, '伊宁', 529, 'Y', '伊宁机场'),
(762, '义乌', 536, 'Y', '义乌机场'),
(763, '营口', 1300, 'Y', '兰旗机场'),
(764, '延吉', 523, 'Y', '朝阳川国际机场'),
(765, '烟台', 533, 'Y', '蓬莱国际机场'),
(766, '盐城', 1200, 'Y', '南洋国际机场'),
(767, '扬州', 15, 'Y', '扬州泰州机场'),
(768, '玉树', 7582, 'Y', '玉树巴塘机场'),
(769, '张掖', 663, 'Z', '张掖机场'),
(770, '昭通', 555, 'Z', '昭通机场'),
(771, '中山', 553, 'Z', '中山机场'),
(772, '湛江', 547, 'Z', '湛江机场'),
(773, '中卫', 556, 'Z', '中卫机场'),
(774, '张家口', 550, 'Z', '张家口机场'),
(775, '珠海', 31, 'Z', '金湾机场'),
(776, '遵义', 558, 'Z', '新舟机场'),
(777, '澜沧', 21596, 'L', '景迈机场'),
(2670, '白城', 1116, 'B', '长安机场'),
(2671, '扎兰屯', 1135, 'Z', '成吉思汗机场'),
(2672, '上饶', 411, 'S', '三清山机场'),
(4538, '遵义', 558, 'Z', '茅台机场'),
(4539, '承德', 562, 'C', '普宁机场'),
(4540, '沧源', 21741, 'C', '佤山机场'),
(4541, '五大连池', 473, 'W', '德都机场'),
(4542, '邵阳', 1111, 'S', '武冈机场'),
(4543, '乌拉特中旗', 21184, 'W', '乌拉特中旗机场'),
(4544, '呼伦贝尔', 4255, 'H', '新巴尔虎右旗宝格德机场'),
(4545, '松原', 1303, 'S', '查干湖机场'),
(4546, '霍林郭勒', 21091, 'H', '霍林河机场'),
(4547, '建三江', 1623, 'J', '建三江机场'),
(4548, '陇南', 7707, 'L', '成县机场'),
(4549, '南竿', 91804, 'N', '南竿'),
(4550, '莎车', 21827, 'S', '莎车机场'),
(4551, '若羌', 21737, 'R', '楼兰机场'),
(4552, '祁连', 20892, 'Q', '海北机场'),
(4553, '信阳', 510, 'X', '明港机场'),
(4554, '岳阳', 539, 'Y', '三荷机场'),
(4555, '图木舒克', 21888, 'T', '唐王城机场'),
(4556, '巴中', 3966, 'B', '恩阳机场'),
(6528, '北京', 1, 'B', '大兴国际机场'),
(6529, '黑河', 281, 'H', '嫩江墨尔根通用机场'),
(6530, '太原', 105, 'T', '太原尧城通用机场'),
(6531, '湖州', 86, 'H', '德清莫干山通用机场'),
(6533, '东阳', 755, 'D', '东阳横店通用机场'),
(6535, '赤峰', 202, 'C', '阿鲁科尔沁机场'),
(6536, '巫山', 684995, 'W', '重庆巫山机场'),
(6538, '甘孜', 21672, 'G', '甘孜格萨尔机场'),
(6540, '郑州', 559, 'Z', '上街机场'),
(6541, '怒江', 1806, 'N', '兰坪丰华通用机场'),
(6542, '石家庄', 428, 'S', '栾城通用机场'),
(9240, '马祖', 7808, 'M', '马祖北竿机场'),
(9241, '建德', 658, 'J', '千岛湖通用机场'),
(9243, '玉林', 1113, 'Y', '玉林福绵机场'),
(9244, '丹凤', 123, 'D', '丹凤商镇通用机场'),
(9246, '滨州', 1820, 'B', '滨州大高通用机场'),
(9247, '于田', 21736, 'Y', '于田万方机场'),
(9248, '陇川', 21525, 'L', '陇川广宋机场'),
(9249, '芜湖', 478, 'W', '芜湖宣州机场'),
(9250, '成都', 28, 'C', '天府国际机场'),
(9252, '武隆', 21259, 'W', '重庆仙女山机场'),
(9254, '菏泽', 1074, 'H', '菏泽牡丹机场');

-- --------------------------------------------------------

--
-- 表的结构 `flight_list`
--

CREATE TABLE `flight_list` (
  `id` int(11) NOT NULL,
  `arrTime` char(50) NOT NULL,
  `airCompanyName` char(50) NOT NULL,
  `airIcon` char(50) NOT NULL,
  `price` int(11) NOT NULL,
  `dptTimeStr` char(50) NOT NULL,
  `arrTimeStr` char(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `flight_list`
--

INSERT INTO `flight_list` (`id`, `arrTime`, `airCompanyName`, `airIcon`, `price`, `dptTimeStr`, `arrTimeStr`) VALUES
(1, '2021-09-05T10:55:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 379, '16:25', '18:55'),
(2, '2021-09-05T03:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 815, '08:35', '11:00'),
(3, '2021-09-05T10:35:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 634, '16:10', '18:35'),
(4, '2021-09-05T12:40:00.000Z', '中国联航', 'https://images3.c-ctrip.com/ztrip/airline/KN.png', 900, '18:30', '20:40'),
(5, '2021-09-05T04:50:00.000Z', '中国联航', 'https://images3.c-ctrip.com/ztrip/airline/KN.png', 843, '10:40', '12:50'),
(6, '2021-09-05T04:50:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 478, '10:40', '12:50'),
(7, '2021-09-05T12:40:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 379, '18:30', '20:40'),
(8, '2021-09-05T02:10:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 326, '07:55', '10:10'),
(9, '2021-09-05T15:55:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 799, '21:30', '23:55'),
(10, '2021-09-05T17:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 777, '22:30', '01:00'),
(11, '2021-09-05T05:55:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 784, '11:30', '13:55'),
(12, '2021-09-05T07:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 836, '12:25', '15:00'),
(13, '2021-09-05T11:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 677, '16:35', '19:00'),
(14, '2021-09-05T08:15:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 910, '13:45', '16:15'),
(15, '2021-09-05T14:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 439, '19:25', '22:00'),
(16, '2021-09-05T12:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 563, '17:30', '20:00'),
(17, '2021-09-05T15:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 742, '20:25', '23:00'),
(18, '2021-09-05T07:55:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 772, '13:25', '15:55'),
(19, '2021-09-05T13:00:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 708, '18:25', '21:00'),
(20, '2021-09-05T09:15:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 446, '14:45', '17:15'),
(21, '2021-09-05T03:10:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 622, '08:55', '11:10'),
(22, '2021-09-05T02:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 670, '08:00', '10:15'),
(23, '2021-09-05T05:00:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 944, '10:30', '13:00'),
(24, '2021-09-05T03:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 958, '09:00', '11:15'),
(25, '2021-09-05T05:20:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 725, '11:00', '13:20'),
(26, '2021-09-05T01:40:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 527, '07:25', '09:40'),
(27, '2021-09-05T04:00:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 462, '09:30', '12:00'),
(28, '2021-09-05T02:45:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 483, '08:30', '10:45'),
(29, '2021-09-05T01:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 974, '07:00', '09:15'),
(30, '2021-09-05T12:00:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 622, '17:30', '20:00'),
(31, '2021-09-05T03:20:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 895, '09:00', '11:20'),
(32, '2021-09-05T16:30:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 386, '22:05', '00:30'),
(33, '2021-09-05T16:30:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 752, '22:05', '00:30'),
(34, '2021-09-05T03:20:00.000Z', '华夏航空', 'https://images3.c-ctrip.com/ztrip/airline/G5.png', 882, '09:00', '11:20'),
(35, '2021-09-05T12:00:00.000Z', '华夏航空', 'https://images3.c-ctrip.com/ztrip/airline/G5.png', 654, '17:30', '20:00'),
(36, '2021-09-05T04:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 454, '10:00', '12:15'),
(37, '2021-09-05T02:35:00.000Z', '中国联航', 'https://images3.c-ctrip.com/ztrip/airline/KN.png', 975, '08:15', '10:35'),
(38, '2021-09-05T02:15:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 743, '08:00', '10:15'),
(39, '2021-09-05T05:20:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 331, '11:00', '13:20'),
(40, '2021-09-05T03:15:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 654, '09:00', '11:15'),
(41, '2021-09-05T04:10:00.000Z', '中国国航', 'https://images3.c-ctrip.com/ztrip/airline/CA.png', 499, '09:55', '12:10'),
(42, '2021-09-05T16:30:00.000Z', '深圳航空', 'https://images3.c-ctrip.com/ztrip/airline/ZH.png', 495, '22:05', '00:30'),
(43, '2021-09-05T02:35:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 812, '08:15', '10:35'),
(44, '2021-09-05T08:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 365, '14:00', '16:15'),
(45, '2021-09-05T07:45:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 413, '13:30', '15:45'),
(46, '2021-09-05T15:50:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 947, '21:30', '23:50'),
(47, '2021-09-05T07:10:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 432, '13:00', '15:10'),
(48, '2021-09-05T08:45:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 590, '14:30', '16:45'),
(49, '2021-09-05T06:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 310, '12:00', '14:15'),
(50, '2021-09-05T15:00:00.000Z', '上海航空', 'https://images3.c-ctrip.com/ztrip/airline/FM.png', 756, '20:30', '23:00'),
(51, '2021-09-05T15:15:00.000Z', '厦门航空', 'https://images3.c-ctrip.com/ztrip/airline/MF.png', 555, '20:50', '23:15'),
(52, '2021-09-05T15:30:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 842, '21:00', '23:30'),
(53, '2021-09-05T14:10:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 332, '20:00', '22:10'),
(54, '2021-09-05T15:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 906, '20:50', '23:15'),
(55, '2021-09-05T15:00:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 696, '20:30', '23:00'),
(56, '2021-09-05T15:55:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 853, '21:30', '23:55'),
(57, '2021-09-05T15:55:00.000Z', '华夏航空', 'https://images3.c-ctrip.com/ztrip/airline/G5.png', 717, '21:30', '23:55'),
(58, '2021-09-05T15:10:00.000Z', '海南航空', 'https://images3.c-ctrip.com/ztrip/airline/HU.png', 702, '20:55', '23:10'),
(59, '2021-09-05T06:30:00.000Z', '海南航空', 'https://images3.c-ctrip.com/ztrip/airline/HU.png', 928, '12:15', '14:30'),
(60, '2021-09-05T05:25:00.000Z', '海南航空', 'https://images3.c-ctrip.com/ztrip/airline/HU.png', 520, '11:15', '13:25'),
(61, '2021-09-05T02:25:00.000Z', '海南航空', 'https://images3.c-ctrip.com/ztrip/airline/HU.png', 670, '08:20', '10:25'),
(62, '2021-09-05T14:55:00.000Z', '海南航空', 'https://images3.c-ctrip.com/ztrip/airline/HU.png', 448, '20:30', '22:55'),
(63, '2021-09-05T14:00:00.000Z', '南方航空', 'https://images3.c-ctrip.com/ztrip/airline/CZ.png', 832, '19:45', '22:00'),
(64, '2021-09-05T10:25:00.000Z', '南方航空', 'https://images3.c-ctrip.com/ztrip/airline/CZ.png', 467, '16:00', '18:25'),
(65, '2021-09-05T02:10:00.000Z', '南方航空', 'https://images3.c-ctrip.com/ztrip/airline/CZ.png', 912, '07:55', '10:10'),
(66, '2021-09-05T09:45:00.000Z', '南方航空', 'https://images3.c-ctrip.com/ztrip/airline/CZ.png', 849, '15:30', '17:45'),
(67, '2021-09-05T06:00:00.000Z', '南方航空', 'https://images3.c-ctrip.com/ztrip/airline/CZ.png', 810, '11:45', '14:00'),
(68, '2021-09-05T14:55:00.000Z', '金鹏航空', 'https://images3.c-ctrip.com/ztrip/airline/Y8.png', 902, '20:30', '22:55'),
(69, '2021-09-05T09:20:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 630, '15:00', '17:20'),
(70, '2021-09-05T10:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 859, '16:00', '18:15'),
(71, '2021-09-05T11:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 600, '17:00', '19:15'),
(72, '2021-09-05T10:00:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 386, '15:30', '18:00'),
(73, '2021-09-05T09:20:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 336, '15:00', '17:20'),
(74, '2021-09-05T11:15:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 722, '17:00', '19:15'),
(75, '2021-09-05T10:15:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 454, '16:00', '18:15'),
(76, '2021-09-05T13:15:00.000Z', '海南航空', 'https://images3.c-ctrip.com/ztrip/airline/HU.png', 765, '18:55', '21:15'),
(77, '2021-09-05T13:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 696, '19:00', '21:15'),
(78, '2021-09-05T12:15:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 945, '18:00', '20:15'),
(79, '2021-09-05T13:50:00.000Z', '东方航空', 'https://images3.c-ctrip.com/ztrip/airline/MU.png', 549, '19:30', '21:50'),
(80, '2021-09-05T13:15:00.000Z', '吉祥航空', 'https://images3.c-ctrip.com/ztrip/airline/HO.png', 815, '19:00', '21:15');

-- --------------------------------------------------------

--
-- 表的结构 `orderList`
--

CREATE TABLE `orderList` (
  `id` int(11) NOT NULL,
  `userPhone` char(11) NOT NULL,
  `dptCityName` char(50) NOT NULL,
  `arrCityName` char(50) NOT NULL,
  `dptTimeStr` char(50) NOT NULL,
  `dptTime` char(50) NOT NULL,
  `price` decimal(10,0) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `orderList`
--

INSERT INTO `orderList` (`id`, `userPhone`, `dptCityName`, `arrCityName`, `dptTimeStr`, `dptTime`, `price`) VALUES
(1, '13800013800', '上海', '北京', '14:37', '2023-02-03', '521'),
(2, '13800013800', '上海', '北京', '14:37', '2023-02-03', '868'),
(3, '13800013800', '上海', '北京', '14:56', '2023-02-03', '638'),
(4, '13800013800', '上海', '北京', '14:56', '2023-02-03', '876'),
(5, '13800013800', '上海', '北京', '14:56', '2023-02-03', '691'),
(6, '13800013800', '上海', '北京', '15:02', '2023-02-03', '329');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `userPhone` char(11) NOT NULL,
  `password` char(10) NOT NULL,
  `nickName` char(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `userPhone`, `password`, `nickName`) VALUES
(1, '13800013800', '123456', '不浪');

--
-- 转储表的索引
--

--
-- 表的索引 `ads`
--
ALTER TABLE `ads`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `airport_list`
--
ALTER TABLE `airport_list`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `flight_list`
--
ALTER TABLE `flight_list`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `orderList`
--
ALTER TABLE `orderList`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `ads`
--
ALTER TABLE `ads`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 使用表AUTO_INCREMENT `airport_list`
--
ALTER TABLE `airport_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9255;

--
-- 使用表AUTO_INCREMENT `flight_list`
--
ALTER TABLE `flight_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- 使用表AUTO_INCREMENT `orderList`
--
ALTER TABLE `orderList`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
